print('hello') #ㅎㅇ요
# 파이썬 프로그램 주석
print('안녕'*5)

'''
    여러줄 주석처럼 사용 될 수 있지만
    프로그램에서 문자열로 생성되므로 주석 ㄴㄴ요.
'''

str1 = '문자열'
print(str1)
str1 = "==========쌍따옴표로 썼음==========="
print(str1)
str1 = '''=========혿따옴표 3개로 썼음==========
(줄바꿈 처리 할 때 이용 할 수 있음)'''
print(str1)
str1 = """=================쌍따옴표 
(줄바꿈 처리 할 때 이용 할 수 있음)3개로 \n썼음"""
print(str1)

print ('오늘은',6,'일 입니다.')
print ('오늘은 '+"6"+'일 입니다.')

print('='*40)


# 얜 줄바꿈 되죠?
print('반짝')
print('반짝')

# 출력 후 줄바꿈 하지 않음
print('반짝', end='')
print('반짝')

print("너무","반짝"*2,"눈이","부셔","No"*5)
print("너무","깜짝"*2,"놀란","나는","Oh"*5)
print("너무","짜릿"*2,"몸이","떨려","Gee"*5)

x = 10
y= 5
sum = x*y
print("두 수의 곱은:",sum)

# 문자열 입력 받기
# 매개변수를 넣어주면 매개변수를 출력해주고 입력 대기
# input() 함수의 반환 타입은 문자열
res = input('이름을 입력해 주세요:')
print(res +"27개월 남았다.")

# 형변환
# 문자타입을 정수타입으로 형변환 
# input은 기본값 문자열이니 항상 신경써줘야겠죠?
num = int(input("첫 번째 정수를 입력하시요: "))
print (num)
# 실수 타입으로 형변환
num1 = float(input("두번째 실수를 입력하시요: "))
print (num1)

print('오늘은'+str(6)+'일 입니다.')